In [1]:
import pandas as pd

In [93]:
# Q1.List any five functions of the pandas library with execution.
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [11]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [13]:
#Q2.Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
# DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [29]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5,3,4,5,6,3,3,4,4,5,1],
    'B': [6, 7, 8, 9, 10,3,6,4,4,3,3,4,6,7,4],
    'C': [11, 12, 13, 14, 15,4,6,5,4,3,4,6,5,6,4]
})

In [30]:
def re_index(df1):
    new_index = pd.RangeIndex(start=1, step=2, stop=len(df1)*2)
  
  
    return new_index

# def reindex_df(df1):
#     new_index = pd.RangeIndex(start=1, step=2, stop=len(df1)*2)
#     new_df1 = df1.reset_index().set_index(new_index)
#     return new_df1

In [31]:
new_index = re_index(df1)

In [32]:
new_index

RangeIndex(start=1, stop=30, step=2)

In [5]:
# new_df1 = reindex_df(df1)

In [88]:
new_df1

    index  A   B   C
1       0  1   6  11
3       1  2   7  12
5       2  3   8  13
7       3  4   9  14
9       4  5  10  15
11      5  3   3   4
13      6  4   6   6
15      7  5   4   5
17      8  6   4   4
19      9  3   3   3
21     10  3   3   4
23     11  4   4   6
25     12  4   6   5
27     13  5   7   6
29     14  1   4   4

In [100]:
#Q3
import pandas as pd

def sum_first_three(df2):
    total = 0
    for i, row in df2.iterrows():
        if i < 3:
            total += row['Values']
    print(total)

In [104]:
df2 = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
sum_first_three(df2)

60

In [109]:
#Q4.
import pandas as pd

def word_count(df, column):
    df['Word_Count'] = df[column].apply(lambda x: len(str(x).split()))
    return df

In [110]:
df = pd.DataFrame({'Text': ['This sentence.', 'Here  another sentence', 'And one one  more.']})
df = word_count(df, 'Text')
print(df)

                     Text  Word_Count
0          This sentence.           2
1  Here  another sentence           3
2      And one one  more.           4

In [113]:
#Q5.DataFrame.size and DataFrame.shape are both used to obtain information about the size of a Pandas DataFrame, but they 
# represent different aspects of the DataFrame's size.

# DataFrame.size returns the total number of elements in the DataFrame, while DataFrame.shape returns a tuple containing
# the number of rows and columns in the DataFrame.

# example: size
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df.size)
# example: shape
import pandas as pd
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df.shape)

6
(3, 2)

In [115]:
#Q6. 
# to read the excel file we use 
df = pd.read_excel('LUSID Excel - Setting up your market data.xlsx')

In [51]:
#Q7.
import pandas as pd

def extract_username(df):
    usernames = df['Email'].apply(lambda x: x.split('@')[0])
    

    df['Username'] = usernames
    
 
    return df

In [53]:
df = pd.DataFrame({'Email':['emteeyazhussain@gamil.com','pwskillls@gmail.com','akbar@gmail.com']})

In [6]:
df =  extract_username(df)

In [7]:
df

                       Email         Username
0  emteeyazhussain@gamil.com  emteeyazhussain
1        pwskillls@gmail.com        pwskillls
2            akbar@gmail.com            akbar

In [2]:
# Q8.
import pandas as pd
df = pd.DataFrame({'column A':[5,8,6,2,9],'column B':[5,2,9,3,1],'column c':[1,7,4,5,2]})

In [23]:
def select_rows(pd):
    select_row = df[(df['column A'] > 5)  & (df['column B'] < 10 )]
    return select_row

In [24]:
select_row = select_rows(pd)

In [25]:
select_row

   column A  column B  column c
1         8         2         7
2         6         9         4
4         9         1         2

In [42]:
# Q9.
import pandas as pd

def calculate_statistics(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std_dev = df['Values'].std()
    return mean, median, std_dev

df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
mean, median, std_dev = calculate_statistics(df)
print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std_dev)

Mean: 30.0
Median: 30.0
Standard Deviation: 15.811388300841896

In [9]:
#Q10.
import pandas as pd

# create sample data
df = pd.DataFrame ({'Sales': [10, 12, 15, 13, 17, 20, 22, 19, 23, 25, 30, 28],
        'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05',
                 '2022-01-06', '2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10',
                 '2022-01-11', '2022-01-12']})


# define a function to calculate moving average
def moving_average(df, window_size=7):
    return df['Sales'].rolling(window_size, min_periods=1).mean()

# add a new column 'MovingAverage' to the DataFrame
df['MovingAverage'] = moving_average(df)

print(df)

    Sales        Date  MovingAverage
0      10  2022-01-01      10.000000
1      12  2022-01-02      11.000000
2      15  2022-01-03      12.333333
3      13  2022-01-04      12.500000
4      17  2022-01-05      13.400000
5      20  2022-01-06      14.500000
6      22  2022-01-07      15.571429
7      19  2022-01-08      16.857143
8      23  2022-01-09      18.428571
9      25  2022-01-10      19.857143
10     30  2022-01-11      22.285714
11     28  2022-01-12      23.857143

In [10]:
#Q11.
import pandas as pd

# create sample data
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
df = pd.DataFrame(data)

# define a function to get weekday name from date
def get_weekday(date_string):
    date = pd.to_datetime(date_string)
    return date.strftime("%A")

# add a new column 'Weekday' to the DataFrame
df['Weekday'] = df['Date'].apply(get_weekday)

print(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [14]:
import pandas as pd

# create sample data
data = {'Date': pd.date_range('2023-01-01', periods=60)}
df = pd.DataFrame(data)

def select_rows_between_dates(df):
    # filter rows between '2023-01-01' and '2023-01-31'
    start_date = pd.Timestamp('2023-01-01')
    end_date = pd.Timestamp('2023-01-31')
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    filtered_df = df.loc[mask]

    return filtered_df